<?php

  // αν δεν υπάρχουν οι παράμετροι που θέλουμε ανακατευθύνουμε, π.χ. στη home
  if ( !isset( $_GET['style'] ) ) {
    header('Location: ../js/index.php');
    exit();
  }
  
  
  //Ακολουθεί (στο switch) o προσδιορισμός του css με βάση την επιλογή του χρήστη
  
  //Προσέξτε ότι οι τιμές που έρχονται στην παράμετρο $_GET['style'] ειναι
  //αλφαριθμητικά και όχι αριθμοί όπως ίσως θα περίμενε κανείς. Μπορείτε πάντα
  //να ελέγξετε τι ακτιβώς έρχεται στις παραμέτρους GET/POST με την εντολή
  //var_dump( ) που παίρνει ως παράμετρο τη μεταβλητή που θέλετε να ελέγξετε.
  //Μπορείτε να κάνετε δοκιμή βγάζοντας τα σχόλια από την ακόλουθη γραμμή. 
  //Προσοχή, λόγω της die η εκτέλεση θα τερματιστεί σε αυτή τη γραμμή.
    
  //die( var_dump($_GET['style']) );

  //  το $_GET['style'] έχει ελεγχθεί ότι υπάρχει στο αρχικό if
  switch ($_GET['style']) {  
    case '1':
      $style = '../css/home.css';
      break;  
    case '2':
      $style = '../css/home2.css';
      break;  
    default:
      // η default επιλογή μας καλύπτει στην περίπτωση που στο URL έρθει
      // για απροσδιόριστο λόγο τιμή δισφορετική από τις προβλεπόμενες 1 ή 2.
      $style = '../css/home.css';
  }

  //Διαγραφή παλαιού cookie (αφού πρώτα ελέγξουμε ότι υπάρχει!).
  //Η διαγραφή γίνεται βάζοντας ημ/νία λήξης στο παρελθόν

  //Σύνταξη: setcookie( <όνομα cookie>, <τιμή cookie>, <ημ/νία λήξης>)
  
  if (isset($_COOKIE['css']))
    setcookie ('css', '', time()-3600);

  //έστω μια νέα ημ/νία λήξης, 120 μέρες μετά
  $expire=  time() + 120*24*60*60 ;

  //βάζουμε το νέο cookie στον browser του χρήστη
  setcookie( 'css', $style, $expire  );

  //στέλνουμε header ανακατεύθυνσης προς την αρχική σελίδα
  header('Location: ../js/index.php');
  exit();

 ?>
 